Documents/ПланГорныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПланГорныхРабот</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Понедельник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вторник</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Среда</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Четверг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пятница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Суббота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Воскресенье</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ВидыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыРабот</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВыпускаемаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИспользуемоеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Оборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПланГорныхРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура РаботыВидРаботПриИзменении(Элемент)
    
    // Получаем текущую строку
    ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем выбранный вид работ
    ВидРабот = ТекущаяСтрока.ВидРабот;
    Если ЗначениеЗаполнено(ВидРабот) Тогда
        // Получаем данные вида работ с сервера
        ДанныеВидаРабот = ПолучитьДанныеВидаРабот(ВидРабот);
        Если ДанныеВидаРабот <> Неопределено Тогда
            // Заполняем единицу измерения и номенклатуру
            ТекущаяСтрока.ЕдиницаИзмерения = ДанныеВидаРабот.ЕдиницаИзмеренияПродукции;
            ТекущаяСтрока.Номенклатура = ДанныеВидаРабот.ВыпускаемаяПродукция;
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура РаботыНоменклатураПриИзменении(Элемент)
    
    // Получаем текущую строку
    ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем выбранную номенклатуру
    Номенклатура = ТекущаяСтрока.Номенклатура;
    Если ЗначениеЗаполнено(Номенклатура) Тогда
        // Получаем данные номенклатуры с сервера
        ДанныеНоменклатуры = ПолучитьДанныеНоменклатуры(Номенклатура);
        Если ДанныеНоменклатуры <> Неопределено Тогда
            // Заполняем единицу измерения
            ТекущаяСтрока.ЕдиницаИзмерения = ДанныеНоменклатуры.ЕдиницаИзмерения;
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеВидаРабот(СсылкаВидаРабот)
    
    Если Не ЗначениеЗаполнено(СсылкаВидаРабот) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Запрашиваем данные вида работ из базы
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ВидыРабот.Ссылка,
        |    ВидыРабот.ВыпускаемаяПродукция,
        |    ВидыРабот.ЕдиницаИзмеренияПродукции
        |ИЗ
        |    Справочник.ВидыРабот КАК ВидыРабот
        |ГДЕ
        |    ВидыРабот.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаВидаРабот);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        // Возвращаем структуру с данными
        Данные = Новый Структура;
        Данные.Вставить("ВыпускаемаяПродукция", Выборка.ВыпускаемаяПродукция);
        Данные.Вставить("ЕдиницаИзмеренияПродукции", Выборка.ЕдиницаИзмеренияПродукции);
        Возврат Данные;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции

&НаСервере
Функция ПолучитьДанныеНоменклатуры(СсылкаНоменклатуры)
    
    Если Не ЗначениеЗаполнено(СсылкаНоменклатуры) Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    // Запрашиваем данные номенклатуры из базы
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Номенклатура.Ссылка,
        |    Номенклатура.ЕдиницаИзмерения
        |ИЗ
        |    Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |    Номенклатура.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНоменклатуры);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        // Возвращаем структуру с данными
        Данные = Новый Структура;
        Данные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
        Возврат Данные;
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции
